#+title: xrates
#+author: michaeltd
#+date: <2020-10-09 Fri>
#+startup: contents

** Depracated Currencies

   #+begin_src bash
   echo -ne ".mode box\n.header on\nSELECT * FROM DEF_CCY_XRATES ORDER BY CCY ASC;" | sqlite3 databases/database.db
   #+end_src

   #+RESULTS:
|------------+-----+---------+------------------------------|
|  LAST_DATE | CCY |     VAL | DESC                         |
|------------+-----+---------+------------------------------|
| 2002-02-28 | ATS | 13.7603 | Austria Schilling            |
| 2002-02-28 | BEF | 40.3399 | Belgium Franc                |
| 2008-01-31 | CYP | 0.58527 | Cyprus Pound                 |
| 2002-02-28 | DEM | 1.95583 | Germany Deutsche Mark        |
| 2011-01-15 | EEK | 15.6466 | Estonia Kroon                |
| 2002-02-28 | ESP | 166.386 | Spain Peseta                 |
| 2008-01-31 | FIM | 5.94573 | Finland Markka               |
| 2002-02-17 | FRF | 6.55957 | France Franc                 |
| 2002-02-28 | GRD |  340.75 | Greece Drachma               |
| 2002-02-09 | IEP | 0.78756 | Ireland Pound                |
| 2002-02-28 | ITL | 1936.27 | Italy Lira                   |
| 2015-01-15 | LTL |  3.4528 | Lithuania Litas              |
| 2002-02-28 | LUF | 40.3399 | Luxembourg Franc             |
| 2014-01-15 | LVL |  0.7028 | Latvia Lats                  |
| 2008-01-31 | MTL |  0.4293 | Malta Lira                   |
| 2008-01-28 | NLG | 2.20371 | Netherlands Guilder (Florin) |
| 2002-02-28 | PTE | 200.482 | Portugal Escudo              |
| 2007-01-14 | SIT |  239.64 | Slovenia Tolar               |
| 2009-01-17 | SKK |  30.126 | Slovakia Koruna              |
|------------+-----+---------+------------------------------|


